backend/controllers/MessagesController.php

SELECT COUNT(*) FROM `messages` WHERE `is_new` = '1'
---
    public function actionIndex() {

        return $this->render('index', [
                'messages' => Messages::find()
                                      ->all(),
                'count'    => Messages::find()
                                      ->where(['=', 'is_new', '1'])
                                      ->count(),
        ]);

SELECT * FROM `messages` WHERE `id`='31'
UPDATE `messages` SET `is_new`=0 WHERE `id`=31
---
    public function actionReadMessage() {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        if (\Yii::$app->request->isAjax && $_POST['id']) {
            $id = Misc::decrypt($_POST['id']);
            if ($id > 0) {
                $model = Messages::findOne($id);
                if ($model) {
                    $model->is_new = 0;
                    if ($model->save() == true) {