backend/controllers/SettingsController.php

    public function actionIndex($id = '') {
        $id = Misc::decrypt($id);
        return $this->render('index', [
                'settings' => Settings::getSettings(),
                'editable' => ($id > 0) ? Settings::findOne($id) : false,
        ]);
---
SELECT * FROM `settings` WHERE `id`='21'