common/components/Helper.php

    public static function getSchedules($departure = null, $show_old = false, $user_id = null) {
        $model = Schedules::find()
                          ->with('bookings')
                          ->with('vehicle')
                          ->with('scheduleRoutes')
                          ->with('user')
                          ->with('createdBy')
                          ->with('updatedBy');

        if ($departure != null) {
            $model = $model->where(['departure' => $departure]);
        }
        elseif ($show_old == false) {
            $model = $model->where(['>', 'departure', date('Y-m-d H:i:s')]);
        }
        else {
            $model = $model->where('departure  BETWEEN CAST("' . date('Y-m-d H:i:s') . '" AS DATE) AND CAST("' . Misc::add_datetime(Yii::$app->params['settings']['search_departure_days']) . '" AS DATE)');
        }

        if (!(Yii::$app->user->identity->role == Yii::$app->params['role_num']['admin'] || Yii::$app->user->identity->role == Yii::$app->params['role_num']['admin'])) {
            if ($user_id === null) {
                $user_id = Yii::$app->user->identity->id;
            }
        }

        if ($user_id != null) {
            $model = $model->andWhere('user_id = ' . $user_id);
        }

        $model = $model->asArray()
                       ->all();
---
SELECT * FROM `bookings` WHERE `schedule_id`='1'
SELECT * FROM `schedules` WHERE `id`='1'
SELECT * FROM `user` WHERE `id`='1'
SELECT * FROM `vehicles` WHERE `id`='1'
SELECT * FROM `schedules` WHERE (`departure` > '2020-03-06 10:06:17') AND (user_id = 30)


                if (!($model->save() == false)) {
                    $table_id = $model->verification_id;
                    $model2 = VerificationActions::find()->where('id=' . $table_id)->one();
                    $model2->table_id = $model->id;
                    $requested_user_id = $model2->requested_by;
                    $requested_user = User::find()->where('id=' . $requested_user_id)->one();
---
SELECT * FROM `verification_actions` WHERE `id` IN ('207', '206', '205', '204', '203', '202', '201', '200', '199', '197', '196', '195', '194', '193', '192', '191', '188', '187', '186', '185', '44', '42', '101', '46', '43', '41', '40', '7', '32')
SELECT * FROM `user` WHERE `id`='1'