common/components/Helper.php

    public static function getSchedules($departure = null, $show_old = false, $user_id = null) {
        $model = Schedules::find()
                          ->with('bookings')
                          ->with('vehicle')
                          ->with('scheduleRoutes')
                          ->with('user')
                          ->with('createdBy')
                          ->with('updatedBy');

        if ($departure != null) {
            $model = $model->where(['departure' => $departure]);
        }
        elseif ($show_old == false) {
            $model = $model->where(['>', 'departure', date('Y-m-d H:i:s')]);
        }
        else {
            $model = $model->where('departure  BETWEEN CAST("' . date('Y-m-d H:i:s') . '" AS DATE) AND CAST("' . Misc::add_datetime(Yii::$app->params['settings']['search_departure_days']) . '" AS DATE)');
        }

        if (!(Yii::$app->user->identity->role == Yii::$app->params['role_num']['admin'] || Yii::$app->user->identity->role == Yii::$app->params['role_num']['admin'])) {
            if ($user_id === null) {
                $user_id = Yii::$app->user->identity->id;
            }
        }

        if ($user_id != null) {
            $model = $model->andWhere('user_id = ' . $user_id);
        }

        $model = $model->asArray()
                       ->all();
---
SELECT * FROM `schedules` WHERE `departure` > '2020-02-27 10:23:30'
SELECT * FROM `schedules` WHERE (`departure` > '2020-03-04 09:47:40') AND (user_id = 13)

    public static function getVendors() {
        $vendors = User::find()
                       ->with('userDetails')
                       ->where(['=', 'status', User::STATUS_ACTIVE])
                       ->andWhere(['=', 'is_verified', '1']);
---
SELECT * FROM `user_details` WHERE `user_id`='13'
SELECT * FROM `user` WHERE `id`='1'

    public static function getVehicles() {
        $vehicles = Vehicles::find()
                            ->with('type0')
                            ->where(['=', 'is_verified', '1']);
        $permission = (isset(Yii::$app->params['permissions']['Vehicles']) && in_array('read', Yii::$app->params['permissions']['Vehicles']));

        if (Yii::$app->user->identity->role == Yii::$app->params['role_num']['vendor']) {
            $vehicles = $vehicles->andWhere(['=', 'user_id', Yii::$app->user->identity->getId()]);
            $vehicles = $vehicles->all();
        }
        elseif ($permission) {
            $vehicles = $vehicles->all();
---
SELECT * FROM `user` WHERE `id`='1'