common/components/HelperAdd.php

    public static function getAdd() {
        $add = Advertisement::find()->orderBy(['id'=>SORT_DESC])->all();
---
SELECT * FROM `advertisement` ORDER BY `id` DESC

    public static function getSingleAdd($id) {
        $singleBlog= Advertisement::find()->
                where('id ='.$id)->
                asArray()->
                one();
---
SELECT * FROM `advertisement` WHERE id =3k