common/components/HelperClients.php

    public static function getOtherclients() {
        $client_id = [];
        $clients_exist = ClientPageContents::find()->asArray()->all();
---
SELECT * FROM `client_page_contents`

    public static function getClients() {
        $clients = Clients::find()->asArray()->all();
---
SELECT * FROM `clients`

    public static function getAllClientsManagement() {
        $clients = ClientPageContents::find()->asArray()->all();
---
SELECT * FROM `client_page_contents`