common/components/HelperBlog.php

SELECT * FROM `blog_categories` WHERE `id` IN (8, 7)
SELECT * FROM `blog`
---
    public static function getBlog() {
        $blog = Blog::find()->with('category')->all();

SELECT * FROM `blog_categories` WHERE `id` IN (8, 7)
SELECT * FROM `blog_comments` WHERE (is_active = 1) AND (is_verified = 1) AND (`blog_id`='17')
SELECT * FROM `blog` WHERE id = 17
---
    public static function getSingleBlog($id) {
        $singleBlog = Blog::find()
                          ->where('id = ' . $id)
                          ->with('category')
                          ->with('author')
                          ->with('blogComments')
                          ->asArray()
                          ->one();

SELECT * FROM `blog_comments` WHERE (is_active = 1) AND (is_verified = 1) AND (`blog_id`='16')
---
    public static function getSingleBlogUser($id) {
        $blog = Blog::find()
                    ->where(['id' => $id])
                    ->with('author')
                    ->with('blogComments')
                    ->asArray()
                    ->all();

SELECT * FROM `blog` WHERE `id`='20'
---
        }
        else {
            $id = $post['id'];
            $model = Blog::findOne($id);

SELECT * FROM `blog_categories`
---
    public static function getCategories() {
        $blog = BlogCategories::find()->all();

SELECT * FROM `blog_categories` ORDER BY `id` DESC
---
    public static function getBlogCategories() {
        $categories = BlogCategories::find()->orderBy(['id' => SORT_DESC])->all();
        return Misc::exists($categories, false);

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=1)
INSERT INTO `blog_categories` (`name`, `remark`, `created_by`, `updated_by`) VALUES ('Avram Mann', 'Ut culpa qui archit', 1, 1)
---
    public static function setCat($data) {
        if (empty($data['id'])) {
            $model = new BlogCategories();
            $model->name = $data['name'];
            $model->remark = $data['remark'];
            $model->created_by = Yii::$app->user->identity->id;
            $model->updated_by = Yii::$app->user->identity->id;
            if ($model->save()) {
                return $model->id;
            }
        }
        else {
            $id = $data['id'];
            $model = BlogCategories::findOne($id);
            $model->name = $data['name'];
            $model->remark = $data['remark'];
            $model->updated_by = Yii::$app->user->identity->id;
            if ($model->save()) {

SELECT * FROM `blog_categories` WHERE `id`='8'
DELETE FROM `blog_categories` WHERE `id`=8
---
    public static function deleteBlogCategory($id) {
        $model = BlogCategories::findOne($id);

        return $model->delete() ? json_encode(true) : json_encode(false);