common/components/HelperCareers.php

SELECT * FROM `careers`
---
    public static function getApplicants() {
        $model = Careers::find()->asArray()->all();