common/components/HelperFaq.php

    public static function getOne($id) {
        $editable = Faq::find()->where(['=', 'id', $id])->one();
---
SELECT * FROM `faq` WHERE `id` = FALSE