common/components/HelperSettings.php

        public static function set($post) {
            $id = Misc::decrypt($post['id']);
            $model = Settings::find()->where('id = '.$id)->one();
---
SELECT * FROM `settings` WHERE id = 22