common/components/HelperExplore.php

    public static function getAll() {
        $explore = Explore::find()->all();
---
SELECT * FROM `explore`

    public static function getOne($id) {
        $editable = Explore::find()->where(['=', 'id', $id])->one();
---
SELECT * FROM `explore` WHERE `id` = FALSE