common/components/HelperCareers.php

    public static function getApplicants() {
        $model = Careers::find()->asArray()->orderBy('created_on DESC')->all();
---
SELECT * FROM `careers` ORDER BY `created_on` DESC

    public static function getVacancy() {
        $model = Vacancy::find()->asArray()->all();
---
SELECT * FROM `vacancy`

    public static function getSingleApplicants($id) {
        $model = Careers::find()->where('id = ' . $id)->one();
---
SELECT * FROM `careers` WHERE id = 2

    public static function getCount() {
        $count_unseen = Careers::find()->where(['=', 'is_new', '0'])->count();
        $count_seen = Careers::find()->where(['=', 'is_new', '1'])->count();
---
SELECT COUNT(*) FROM `careers` WHERE `is_new` = '0'
SELECT COUNT(*) FROM `careers` WHERE `is_new` = '1'

    public static function Status($id) {
        $newStat = Vacancy::find()->where('id =' . $id)->asArray()->one();
---
SELECT * FROM `vacancy` WHERE id =2

    public static function setStatus($data) {
        $id = $data['id'];
        $model = Vacancy::findOne($id);
        $model->updated_on = date('Y-m-d H:i:s');
        $model->is_active = $data['is_active'];
        if ($model->save()) {
---
SELECT * FROM `vacancy` WHERE `id`='3'
UPDATE `vacancy` SET `is_active`=0, `updated_on`='2020-02-28 13:03:21' WHERE `id`=2