common/components/HelperMessages.php

SELECT COUNT(*) FROM `messages` WHERE `is_new` = '1'
SELECT COUNT(*) FROM `messages` WHERE `is_new` = '0'
---
        public static function getCount()
        {
            $count_unseen =Messages::find()->where(['=','is_new','1'])->count();
            $count_seen =Messages::find()->where(['=','is_new','0'])->count();