common/components/HelperNews.php

SELECT * FROM `news`
---
    public static function getNews() {
        $news = News::find()->all();

SELECT * FROM `news` WHERE `id`='7'
---
    public static function set($data, $image = '') {
        if ($data['post']['id'] != '') {
            $id = $data['post']['id'];
            $model = News::findOne($id);