common/components/Verification.php

    public static function getActions() {
        return VerificationActions::find()->with('verifieduser')->with('requesteduser')->asArray()->orderBy(['id' => SORT_DESC])->all();
---
SELECT * FROM `user` WHERE `id`='1'
SELECT * FROM `verification_actions` ORDER BY `id` DESC

    public static function getSingleAction($id) {
        $actions = VerificationActions::find()
                                      ->where(['id' => $id])
                                      ->with('requesteduser')
                                      ->with('verifieduser')
                                      ->asArray()
                                      ->one();
---
SELECT * FROM `user` WHERE `id`='1'
SELECT * FROM `verification_actions` WHERE `id`='182'

    public static function verifyAction($verify) {

        $id = $verify['id'];
        $model = VerificationActions::findOne($id);
---
SELECT * FROM `verification_actions` WHERE `id`='182'

    public static function getComments() {
        return BlogComments::find()->with('blog')->with('verifieduser')->with('requesteduser')->asArray()->orderBy(['id' => SORT_DESC])->all();
---
SELECT * FROM `blog_comments` ORDER BY `id` DESC
SELECT * FROM `blog` WHERE `id` IN ('19', '17')
SELECT * FROM `user` WHERE `id` IN ('1', '13')

    public static function getSingleComment($id) {
        $actions = BlogComments::find()
                               ->where(['id' => $id])
                               ->with('blog')
                               ->with('requesteduser')
                               ->with('verifieduser')
                               ->asArray()
                               ->one();
---
SELECT * FROM `blog_comments` WHERE `id`='25'
SELECT * FROM `blog` WHERE `id`='16'
SELECT * FROM `user` WHERE `id`='1'