common/models/Settings.php

SELECT * FROM `settings` ORDER BY `id` DESC
---
    public static function getSettings(){
        return parent::find()->asArray()->all();